app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 24 Nov 2012 20:10:32 UTC +00:00], ["updated_at", Sat, 24 Nov 2012 20:10:32 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 30], ["created_at", Sun, 23 Dec 2012 10:51:02 UTC +00:00], ["order_id", nil], ["product_id", 1], ["quantity", 1], ["updated_at", Sun, 23 Dec 2012 10:51:02 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-11-27 12:51:39.359375' WHERE "line_items"."id" = 2