app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
UPDATE "users" SET "password_digest" = '$2a$10$38w22v2lTQ5DjQFTYRKTF.Tug47LXtdbENHqDV/jwva3YeHmVWlAy', "updated_at" = '2013-01-20 02:28:16.750000' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])